In [1]:
import pandas as pd
import numpy as np

In [4]:
data = pd.read_csv("nameToSplit.csv", header=None, names=['name'])
data.head()

                 name
0     Akshita Khurana
1  Aarthi Srivathsan
2  Aarthi Srivathsan
3          Aishwarya
4          Aishwarya

In [11]:
data1 = data.name.str.split(n=1, expand=True)
data1.head()

           0            1
0    Akshita      Khurana
1     Aarthi  Srivathsan
2     Aarthi  Srivathsan
3  Aishwarya         None
4  Aishwarya         None

In [12]:
data1.to_csv("splitedNames.csv", header=None, index=None)